{
	"author": "Uditha Devapriya",
	"link": "https://medium.com/@udithadevapriya/martin-wickramasinghe-and-a-g-fraser-99a5db0290e8",
	"text": [
		{"paragraph": "On 7 February 1971, Trinity College, Kandy held its 99th annual Prize Giving. Presided by the then Anglican Bishop of Kurunegala, Lakshman Wickremesinghe, the ceremony featured Martin Wickramasinghe as its Chief Guest. By this point Wickramasinghe had become Sri Lanka’s leading literary figure. A grand old man of 80, he was now writing on a whole range of topics outside culture and literature. His essays addressed some of the more compelling socio-political issues of the day, including youth unrest. His speech at the Prize Giving dwelt on these issues."},
		{"paragraph": "Wickramasinghe’s speech centred on A. G. Fraser, Principal of Trinity from 1904 to 1924. Considered one of the finest headmasters of the day, Fraser broke ground by incorporating vernacular languages to the school syllabus and indigenous cultural elements to the school environment. Fraser was 10 years into his principalship when Wickramasinghe wrote his first novel, Leela. His tenure coincided with some of the more transformative events in British Ceylon, including the McCallum and Manning constitutional reforms. His zeal, especially for indigenising Christianity and missionary education, won him as many allies as it did enemies. Eventually, it encouraged other educationists to follow suit."},
		{"paragraph": "The world Fraser saw through was different to the world Wickramasinghe grew up in. Yet in many ways, they were not too different. Fraser had been born to a typical colonial family: his father, Sir Andrew Henderson Leith Fraser, had served as Lieutenant-Governor of Bengal under Lord Curzon. Wickramasinghe, on the other hand, did not obtain a proper education: having left school at an early age, he had been self-educated and self-taught. Both, however, lived through an era of irreversible social transformation, and both played leading roles in that transformation."},
		{"paragraph": "It is not clear whether the two of them ever actually met. But the two of them shared a disdain for the culture of imitativeness which had become fashionable among the colonial, Westernised middle-class. Through their fields — education in Fraser’s case, literature in Wickramasinghe’s — they strived to change that culture."},
		{"paragraph": "By 1971 that culture had changed, and Wickramasinghe’s contribution, as well as Fraser’s, had been widely acknowledged. It is this contribution which Wickramasinghe addressed in his speech at the Prize Giving. Hailing Fraser as a “genuine educationist”, Sri Lanka’s leading Sinhalese litterateur commended Trinity’s greatest principal’s efforts at indigenising the school and the syllabus. In doing so, he categorically refuted the allegation, popular among nationalist ideologues, that Fraser had “created a hostile attitude in the minds of the boys of Trinity to their own culture and language.” From that standpoint, he conceived an intelligent and, in my view, well-rounded critique of chauvinism, which scholars of the man have barely if at all touched in their appraisals of his work."},
		{"paragraph": "In a recent, intriguing essay on agrarian utopianism, Dhanuka Bandara invokes Stanley Tambiah’s claim that the concept of gama, pansala, wewa, yaya, so central to the Sinhala nationalist discourse, emerged from Martin Wickramasinghe’s work. To a considerable extent, this is true, and Dhanuka goes to great lengths to show it was. Wickramasinghe’s essays — including those on Sinhalese culture — depicts an almost pristine society, not unlike Ananda Coomaraswamy’s vision of Kandyan art and culture."},
		{"paragraph": "Comparisons between Wickramasinghe and Coomaraswamy are not as crude as they may appear to be. Both idealised rural Sinhalese culture, and both depicted it as an organic, tightly knit community pitted against the forces of modernity. Yet there were important differences. While Coomaraswamy, as Senake Bandaranayake’s essay on the man clearly argues, sought to preserve Kandyan art and culture throughout his life, his celebration of that culture led him to idealise a feudal, static social order. This critique, of course, can itself be critiqued, particularly by those who harbour a different view on Coomaraswamy. But, in my opinion, it stands in marked contrast to Wickramasinghe’s celebration, not of cultural pristineness, but of cultural synthesis and pluralism."},
		{"paragraph": "Indeed, throughout his essays, Wickramasinghe hardly exudes an Arnoldian affirmation of high culture. He does not pretend to uphold a great tradition. He is concerned not with keeping intact the values of a pristine society, but with ensuring continuity and change within a certain framework and environment. Contrary to certain cultural nationalists who may imagine him to be one of them, this framework is neither exclusivist nor chauvinist. That is arguably most evident in his critiques of the vernacularisation of education in the 1950s. While admitting the need for the shift to swabasha, he criticises those who, in the guise of devising a “national” education system, went overboard in their attempts at reviving a dead, supposedly superior past in school curricula and syllabuses."},
		{"paragraph": "Wickramasinghe’s Trinity College speech presciently underlies these concerns. Addressing the students’ movement in the West and growing student unrest in Sri Lanka, he traces the angst of the youth to an increasingly fragmented society."}
		{"paragraph": "“The two causes peculiar to our country which generate discontent in the students of higher educational institutions and sometimes incite them to revolt are bureaucratic control, and the paternal attitude of the society towards them. The bureaucratic control of higher educational institutions based on foreign traditions and the class system that encouraged exploitation is an inheritance from the English colonial system. And the growth of the paternal attitude of the society to the student population is mainly due to an attempt of Buddhist monks and nationalists to revive the past with its dead culture.”"}
		{"paragraph": "This is a remarkable observation, at odds with the conventional view of Wickramasinghe as an advocate of an organic, pristine past. He is criticising not just the English colonial system which has survived the transition to independent statehood in Sri Lanka, but also Buddhist monks and nationalists — none less! — who idealise a superior, classical culture and try to revive it everywhere. These issues, he contends, are at the centre of youth unrest, and they have pushed the young to rebel."}
		{"paragraph": "“The attempt to inculcate a blind and meek obedience in boys and girls for their elders and teachers is an attempt to revive the divine rights of kings. Parents deserve love, gratitude and kindness form their sons and daughters, but not surrender. What is required is not blind obedience which creates conscious and unconscious

 hypocrisy, but discipline on the basis of their own independent and changing culture.”"}
		{"paragraph": "Here one is struck not merely by the author’s siding with the rebelling youth, but also by his unconditional support for their pursuit of an “independent and changing culture.” It ties in with his own belief in the inevitability of change and transformation, of the sort he and A. G. Fraser encountered and affirmed in their day. Indeed, like Fraser, Wickramasinghe critiques the colonial elite’s dismissal of national culture, yet does not embrace an exclusivist framing of this culture. “The word nationalism,” he comments, “apart from the consciousness of the cultural unity of a community, means chauvinism.” This is a remarkable observation from a man whom cultural nationalists today appropriate as one of them."}
		{"paragraph": "Some of his other essays from this time reveal an even more radical view on culture."}
		{"paragraph": "“There is a cultural unity among the common people in spite of differences of religion, language, and race. They are not interested in a state religion, communal and religious rights because they instinctively feel that there is an underlying unity in religion and race. Agitation for a state religion and communal rights emanates from a minority of educated people who have lost the ethos of their common culture.”"}
		{"paragraph": "“Impetus for the Growth of a Multiracial Culture”"}
		{"paragraph": "It is important to note that such views were entirely in line with A. G. Fraser’s. Fraser’s zeal for indigenisation, which inspired the two most prominent faces of Anglicanism in post-colonial Sri Lanka, Lakdasa de Mel and Lakshman Wickremesinghe, was one rooted not in the narrow frame of “Sinhala Only”, but in an all-encompassing nationalism. Fraser’s intervention in the 1915 riots, derided by nationalist elites at the time, but defended by James Rutnam later, shows that to some extent."}
		{"paragraph": "Here, for instance, is Fraser speaking at the College Prize Giving in 1908."}
		{"paragraph": "“When I came here four years ago I was astonished to find that senior students who hoped to serve amongst their people could neither read nor write their own language… a thorough knowledge of the mother tongue is indispensable to true culture or real thinking power. More, a college fails if it is not producing true citizens and men who are isolated from the masses of their own people by ignorance of their language and thought can never fulfil the part of educated citizens or be the true leaders of their race.”"}
		{"paragraph": "It would be useful to quote from Wickramasinghe’s 1971 speech."}
		{"paragraph": "“A child must adapt and respond to that environment of the greater society to develop his intellectual and creative faculties. If he is trained to adapt and respond only to the environment of his family circle who are mere imitators, the development of his intellectual and creative faculties will be retarded.”"}
		{"paragraph": "Both Fraser and Wickramasinghe, in other words, are affirming the need for a child to grow amidst his environment, to absorb it, to adapt to it."}
		{"paragraph": "Wickramasinghe’s Trinity College speech needs to be reassessed and reappraised. It distils his views on education and indigenous culture, and his critique of extremist and exclusivist variants of cultural nationalism. It is one of the best sources we have on the man’s views on these issues, and it needs to be placed in the context of its time: just two months after the Prize Giving, Sri Lanka would encounter a widespread youth insurrection, the likes of which it had never dealt with before. Martin Wickramasinghe would pass away five years after the Prize Giving, almost 15 years after Fraser’s passing. Fraser’s contribution, and Wickramasinghe’s affirmation of it, underlies a vision of nationalism and culture that was more inclusive, more diverse, and thus more representative of our country and our people."}
		{"paragraph": "Note: The original version of this article stated that the Prize Giving took place in 1970. This was based on a source from a collection of essays by Martin Wickramasinghe (Martin Wickramasinghe, Complete Works: Volume 10, Essays in English, Tisara Prakashakayo, 1997, page 513). I have since been informed that the ceremony took place a year later."}
	]
}