{
	"author": "Uditha Devapriya",
	"link": "https://medium.com/@udithadevapriya/ranil-wickremesinghe-and-the-politics-of-incompatibility-d1f44460bb32",
	"text": [
		{"paragraph": "A recent World Food Programme report underlies the magnitude of the food crisis in Sri Lanka. The report shows that 36% of the country’s households are effectively food insecure, while 76% are engaging in “food-coping strategies.” 35% of the country’s households are “facing insufficient food consumption”, while female-headed households (44%) are “faring worse” than male-headed ones."},
		{"paragraph": "Worryingly, food insecurity rose by four percentage points from September to October, its worst effects felt by marginalised communities like estate workers. Citing the report, AdaDerana notes that with “limited purchasing power, over 50% of households are purchasing food on credit.”"},
		{"paragraph": "These are all damning indictments on an administration that is yet to be punished, legally or electorally, for its crimes. They are all traceable to Gotabaya Rajapaksa’s disastrous if not misconceived fertiliser policy. They are more or less the work of policymakers and advisors who should have known better. They continue to bedevil the country, which continues to pay for the sins of its past."},
		{"paragraph": "The WFP report also records an interesting breakdown of the situation across provinces: between September and October, six of nine provinces saw a rise in food insecurity. While 48% of all households in the Southern Province and 45% in the Sabaragamuwa Province have become food insecure, the North and the East face much less of a problem, with scores of 26% and 25%. This is a significant gap."},
		{"paragraph": "What the report shows is that the food crisis is affecting the Southern half of the country more than it is the North and East. In effect the poorest regions — from Badulla to Moneragala, across the Uva and Southern Provinces — are faring worse than the rest of the country. Put simply, the Southern peasantry, the core constituency of the SLPP, led by the Rajapaksas, has become the biggest victims of this government."},
		{"paragraph": "The government, for its part, has pledged repeatedly to eradicate a food shortage. It has little choice in the matter: no administration can afford to stay in power if it fails to pacify a food-deprived South. A failure there can only spark an agrarian crisis."},
		{"paragraph": "What do all these mean? They underlie two crucial National Questions facing Sri Lanka now. The first has to do with its Tamil (and Tamil speaking) communities. The second has to do with its agrarian (and largely Sinhala speaking) community. The first has to do with language and constitutional reforms; the second has to do with radical economic reforms, or the need to industrialise the country. The first is concentrated in the North and East; the second in the South, and by extension in the Uva, North-Central, and North-Western Provinces. Both issues remain unresolved and unaddressed, because successive regimes have attempted to resolve and address the one without properly looking into the other."},
		{"paragraph": "President Ranil Wickremesinghe has implored Tamil parties to help him resolve minority grievances — in effect, the first National Question — and set out a programme before the country celebrates its 75th Independence Day next month. His enthusiasm for this predates his election as President: as D. B. S. Jeyaraj reports, Wickremesinghe called Mano Ganesan, the Tamil Progressive Alliance and SJB MP, to alert him on “his intention to resolve the Tamil National Question.” This was on July 19, two days before the SLPP voted him as President in the parliament. What surprised Ganesan, Jeyaraj writes, is that the “Interim President” did not canvass his support for the election. Jeyaraj comments that this shows Wickremesinghe is aware of the need “to resolve issues affecting the Tamil people.”"},
		{"paragraph": "But just how will Wickremesinghe resolve these issues? The Tamil National Alliance has laid down a three-step strategy. The first involves the settlement of issues such as the release of political prisoners and the return of lands appropriated from the North; the second involves the implementation of the 13th Amendment; and the third involves political and constitutional reforms aimed at greater devolution and power-sharing. The President has already convened a conference and the TNA has had its say on these matters there. It is reasonable to assume that he will see their proposals through."},
		{"paragraph": "On the surface, of course, these matters seem easy to resolve. Civil society has correctly contended and emphasised that during a crisis, it is vital to bring Sri Lankans together on matters concerning minority rights. By that yardstick, the crisis we are facing now is a near-perfect, if not perfect, platform on which the President and his administration can put into effect long dormant reforms aimed at the country’s minorities, particularly the Tamils. In this he can count on the support of not just the SLPP, but also minority parties, which have, since September, sent mixed, ambivalent signals about their support for him."},
		{"paragraph": "Interestingly, these parties have lent their support even though the President’s legitimacy, hollow and questionable as it is, rests on the support of a ruling party that has splintered into two factions. They have lent support not fully realising that the man is trying to resolve one National Question while not doing enough to resolve the other."},
		{"paragraph": "The simple truth is that, as long as the government he leads imposes burdens, in the form of more taxation and welfare cuts, on the people, and goes ahead with unpopular measures, like the privatisation of state assets — which, as Asoka Bandarage has correctly pointed out, are being auctioned off to state owned enterprises in other countries — Wickremesinghe will find it difficult to handle the ensuing rebellion. The WFP report implies this well: the North and East is in a situation where it can be pacified with political and constitutional reforms, but the South has become a hotbed of economic insecurity. For all intents and purposes, however, Tamil parties supporting him have ignored these considerations."},
		{"paragraph": "Here, one discerns a disconnect between the SLPP’s core constituency — the Sinhala and largely Buddhist peasantry and middle-classes — and the general thrust of Wickremesinghe’s reform proposals, which centre on minority communities. This is not really a contradiction. Since last year, the SLPP has lost the support of its core constituencies and it is, for the lack of a better way of putting it, seeking greener pastures elsewhere."},
		{"paragraph": "The person it chose to elect as President over its own candidate, Dulles Alahapperuma, is being seen by civil society and the Tamil political mainstream as more amenable to their causes than the rival SLPP faction and Opposition. Yes, the SLPP may not be comfortable with the direction he is taking them in, but they have little choice in the matter: he saved them after the events of July 13, and they must now return the favour."},
		{"paragraph": "Whatever his intentions, therefore, there’s no denying that Wickremesinghe’s proposals are ambitious. They aim at no less than the resolution of issues that divided the electorate, and pitted much of it against Wickremesinghe’s party in 2019."},
		{"paragraph": "Back then, the SLPP used fears of the country being divided and sold to foreign interests to upend that party. Now that the tide has turned and the man derided as a traitor has sided with the outfit that derided him as such then, the ruling party has reversed course. From a practical perspective, it thus makes sense to support any reasonable pro-minority measures, because they have been left unaddressed far too long and every party, including the main Opposition, is united on them today. As far as the President ensures their implementation, the Opposition should support them — even if their support is conditional."},
		{"paragraph": "The latter point is crucial, however. Why? Because neither the SLPP nor the UNP has come out with a proper programme for the second, more urgent, National Question, concerning food and economic security."},
		{"paragraph": "These issues concern the whole country, but the WFP report clearly indicates that they are affecting some parts more than others. Yet, the regime seems hell-bent on imposing austerity on the people and doing little from their end to ease the suffering of the many. Against such a backdrop, whatever support the Opposition gives to the President, for his reforms on minority rights, has to be contingent on his taking more proactive steps to resolve the country’s economic problems."},
		{"paragraph": "President Wickremesinghe should know that this is in his interests as well. Pacifying one region without doing enough for the others, after all, can only deepen his lack of legitimacy, and contribute to even more chaos, disorder, dissent, and rebellion in the long term. At the end of the day that will help neither him nor the system he says he wants to change; nor, for that matter, the ethnic minorities he says he wants to do justice to."}
	]
}
