{
	"author": "Uditha Devapriya",
	"link": "https://medium.com/@udithadevapriya/so-long-kalang-f90b98c6a394",
	"text": [
		{"paragraph": "It is perhaps ironic that Amarasiri Kalansuriya joined the Second Volunteer Battalion of the Sinha Regiment the year he turned 18. Ironic, because it was this Battalion that the United Front government mobilised against JVP insurrectionists in 1971. Ironic, because Kalansuriya, who died last week aged 82, epitomised in film after film the anxieties and frustrations of the generation from whose ranks those insurrectionists sprang. Yet for what it was worth, his military stint did not last long: after leaving it, he found himself jumping from one job after another, trying to make ends meet. These experiences tempered him, humbled him, formed him, and brought him closer to those felt hard done by the establishment."},
		{"paragraph": "Kalansuriya was truly the last of his generation. All his peers, including Wimal Kumara da Costa, Daya Tennakoon, Somasiri Dehipitiya, Dharmasena Pathiraja, and Vijaya Kumaratunga, have long gone. His passing, in that sense, signifies a transition in much the same way that Sumitra Peries’s passing did two months ago. To those of us who knew him and cherished his performances, he was always Kalang. Indeed, at a point it seemed as though his life and his acting were fused in one, as though the one was inseparable from the other. In the end this became his signature."},
		{"paragraph": "His breakthrough performance was in Dharmasena Pathiraja’s Ahas Gawwa, in 1974. There he played an aimless drifter, one of the hundreds of thousands of unemployed youths who seemed to have no hope, no sense of direction, no real purpose, who dotted our country’s social landscape no matter where they were. Early on in the film, a friend of Kalansuriya’s character, played by Wimal Kumara da Costa, reads the government gazette for a vacancy. He does so after congratulating another friend, played by Wickrema Bogoda, who has just found a job. Though the job is modest — it’s a security guard’s post, presumably at a government institution — the friend’s sense of elation at getting it makes us realise the underlying sense of desperation and frustration. It was an era that Kalansuriya found himself part of, an era which bore within it its own contradictions and tensions — an era which he eventually distilled."},
		{"paragraph": "Writing on Vijaya Kumaratunga after his assassination, “Jayadeva” quoted Marilyn Monroe: “The people made me a star — no studio, no person, but the people did.” If this was true of Vijaya, it was no less true of Kalansuriya. Kalang’s conception of the hero differed from the heroic type that had been immortalised by Gamini Fonseka. Kalang did not exude Gamini’s heroic stature. In Apeksha, which cast him into the sort of stardom that Pathiraja’s film did not, he is hardly a hero. Shy, effusive, and reluctant to talk, he has to be pushed into asking Malini Fonseka out. When the two of them do fall for each other, they must confront their class differences. For a while, Kalang gets into the good books of her father, played by Felix Premawardhana, by passing as her rich boyfriend. Eventually, when his identity is revealed, her father has him ejected from their house."},
		{"paragraph": "Almost 15 years before Apeksha, Gamini played this kind of lover in Getawarayo. But there was only one Getawarayo in Gamini’s entire career. In every other film he was in, where he had to confront class differences, he always resorted to the easy way out. In Sahanaya, for instance, he plays a poor artist who makes his living painting portraits of the rich. When a rich heiress played by Malini Fonseka discovers that he has secretly painted her because he is so smitten with her, she strikes him. Later, feeling sorry for him, Malini invites him to her house. There the two of them talk with one another and discover their love for each other. Just as they are about to take off, though, the girl’s father, played by Mark Samaranayake, discovers them. This forces the girl to elope with him, and for the rest of the film, through a maze of songs, dances, and fights, they stick together."},
		{"paragraph": "If in the 1960s and 1970s Sinhala film directors resorted to that formula with despairing frequency, in the late 1970s a new generation of directors sought to challenge it. In 1979 Vasantha Obeyesekere fired the first salvo with Palagetiyo, the film which cemented his reputation as a radical, avant-garde artist. Much earlier, H. D. Premaratne blurred the line between artistic or “serious” and commercial or “mainstream” film by blending elements of both, challenging the codes of the mainstream Sinhala film."},
		{"paragraph": "With his first three films — Sikuruliya, Apeksha, and Parithyagaya — Premaratne depicted a society on the cusp of a pivotal and unprecedented transformation. By casting Kalansuriya as the lead in two of them — Apeksha and Parithyagaya — he made him a leading face of that society. In Apeksha particularly, with its medley of Clarence Wijewardena songs, Kalansuriya retained something of a heroic stature. At the same time, he remained the relentless radical, the outsider trying to get in."},
		{"paragraph": "Thus, while riding on the Sinhala cinema’s second wave — a wave led by the likes of Pathiraja and Obeyesekere — Kalansuriya did not repress his looks, his charm, his careless streak. This was true of Vijaya too. It helped both cement their careers: had they retreated to the radical iconoclasm of their directors, the two of them would have been dismissed as freaks. But they refused to do so, and in refusing to do so they remained attached to their people: to quote “Jayadeva”, they did what they could to prevent “the erection of walls” between themselves and the public."},
		{"paragraph": "For his part, then, Kalansuriya remained an unabashed populist — though not to the same extent as Vijaya — because it was the only way he could be with his audiences. Moreover, by now Gamini Fonseka had reached the zenith of his career, and was dabbling in conservative politics. Vijaya and Kalang remained defiantly detached from all that."},
		{"paragraph": "It would of course be wrong to pigeonhole Kalang into a particular political affiliation. Yet like Vijaya, he came from a Sinhala educated background. Kalang was not pushed into Left politics as a child or even a teenager: in this he differed from the earlier generation of artists and intellectuals, who had absorbed Marxist politics at school or university. To quote Regi Siriwardena, that disability helped him imbibe “that humanism, generosity and compassion which are the better part of the Sinhala tradition”, qualities which would be submerged by the tide of chauvinism and political authoritarianism. Kalang’s circumstances on this front differed only slightly from Vijaya’s: unlike the latter, who had the benefit of an education at an elite Colombo school, he jumped from one establishment to another, eventually settling at Dharmaraja College Kandy. There he excelled at sports, including boxing, activities which toughened him: in Lester Peries’s Akkara Paha, as Douglas Ranasinghe’s sidekick, he has his first encounter with the protagonist while playing soccer on the schoolground."},
		{"paragraph": "From being Ranasinghe’s sidekick, Kalang gravitated to Vijaya. In Sugathapala Senarath Yapa’s Hanthane Kathawa, he distinguishes himself somewhat as a sympathetic friend of the protagonist, played by Tony Ranasinghe. Ranasinghe hailed from an earlier generation, and in Yapa’s film he feels constantly threatened by Vijaya, who seeks the attention of the girl he happens to be hankering after."},
		{"paragraph": "As his friend, Kalang tries to resolve these tensions, but in the end has no choice but to leave Ranasinghe to fend for himself. Perhaps one of the most underrated Sinhala films ever made, Hanthane Kathawa gives us a glimpse of university life that would be upturned and uprooted in the 1970s. It was in that decade that Kalansuriya underwent an apotheosis of sorts. As he did so, he found common ground with Vijaya in two landmarks: Ahas Gawwa and Bambaru Avith, both directed by Pathiraja."},
		{"paragraph": "It is difficult to say what Vijaya would have transformed or evolved into had he survived his assassination. In Kalansuriya’s case, the vibrant career he carried forward in the 1970s and the early 1980s flickered and dimmed: from averaging two films a year in the late 1970s, he slumped to a film per year, two years, and then three, before letting go completely. This is not to say he retired completely from acting: he did make the occasional appearance, in the occasional film or television serial. Yet these were mere replicas of the roles he had played at his peak."},
		{"paragraph": "Perhaps that was his way of defying the passing of an era, an era he had been a leading face of. Whatever the reason may be, of course, there is no doubt that his death symbolises that passing, that transition, in a way his retirement could not. What makes his more poignant and regrettable is the simple, undeniable fact that he was not just the last of his kind or generation, but also, at one level, the last of us."}
	]
}
s