{
	"author": "Uditha Devapriya",
	"link": "https://medium.com/perceive-more/sumitra-peries-looking-back-in-nostalgia-753aeeeeee0",
	"text": [
		{"paragraph" : "The cinema of South Asia blows up in a riot of colour and spectacle, offering a melange of romance, action, and history. Despite its modest scale, this is one of the biggest film industries in the world, worth around 180 billion rupees (roughly 2.4 billion US dollars) in India alone. Today it has transformed into a category of its own, mixing different genres and, at least in India, earning the apt moniker “masala cinema.”"},
		{"paragraph" : "However, while many scholars have written on this industry, few among them seem to have noted its contribution in a rather unlikely front: women’s filmmaking."},
		{"paragraph" : "Surprising as it may seem, several women made their mark as directors in South Asia. While attempting a chronology is difficult, the first such director is considered to be Fatma Begum. In 1926, when Lillian Gish considered ending her career with D. W. Griffith and MGM was offering her a six-movie deal, Begum made her first film through her own production house, Fatma Films. Later, in Pakistan, Parveen Rizvi and Shamim Ara made their debuts as directors, while much later in Bangladesh, Kohinoor Akhter followed suit."},
		{"paragraph" : "What bound these women together was the way their careers developed. All of them had to transition from acting to directing. It was later, with the onset of a New Wave in Indian cinema in the 1980s, that a new generation of filmmakers, among them Mira Nair and Deepa Mehta, took centre stage. The only notable exception to this trend, who continues to stand out, is to be found outside India."},
		{"paragraph" : "Long orientalised for its sandy beaches and mist-clad mountains, Sri Lanka boasts of an obscure but vibrant cinema. Though dominated by men, women too have made their mark in it, and not just in acting. Among them one name stands out: Sumitra Peries, the country’s oldest living filmmaker."},
		{"paragraph" : "With 10 films to her name, Sumitra has emerged as one of the country’s foremost cultural icons. Her career offers a contrast to that of many of her contemporaries. For one thing, unlike most South Asian woman directors her age, such as Aparna Sen, she never took up acting: she began her career as an assistant director and an editor. Moreover, unlike them, she travelled extensively and studied cinema in Europe. It is this that makes her work, even her life, stand out."}
		...and so on (the content continues)
	]
}
