{
	"author": "Uditha Devapriya",
	"link": "https://medium.com/@udithadevapriya/bitter-sugar-bad-oil-e9aab93eaced",
	"text": [
		{"paragraph" : "The recent scandals involving sugar and coconut oil should point the country to the dangers of private rent-seekers. This is especially so because they are not your typical supermarket groceries: these are fast-moving goods, consumed by every class, and from every income level."},
		{"paragraph" : "In the hands of racketeers and rent-seekers, ensuring the most rudimentary health and safety checks for such necessities seems to have taken a backseat to profiteering off them. While it is unfair to take the government to task over such failings, it is the government which has the final discretion in rectifying those failings. As such they should be critiqued."},
		{"paragraph" : "And yet, the question can (validly) be raised whether public perceptions of these scandals reflect what’s really going on. For obvious reasons, it is the government that’s accused of being complicit with and profiteering from alliances with dubious interests in the sugar and coconut oil import mafia. Such allegations, for me at least, limit these scandals to two frames: the public sector and the present government. To put it simply, much of the backlash against the sugar tax fraud and the adulteration of imported oil seems to be directed generally to the public sector, and specifically to the present administration."},
		{"paragraph" : "The issue here is that insofar as the public sector has caved into the interests of dubious private mafias and the present regime has given the impression of caving into them more dangerously, this is hardly the whole story. There are important interests at work, interests that neither the public nor the Opposition seems to be aware of."},
		{"paragraph" : "Take the coconut oil imbroglio. The allegation is that adulterated oil was allowed into the country, bypassing all established laws and regulations. The adulteration in question involves a toxic carcinogen, Aflatoxin. While customs officials have determined that samples from local stores do not contain the substance, samples collected earlier from warehouses do. Dashitha Niroshana, Director General of the Coconut Development Authority, has assured consumers to have no fear about what’s in the market, while Minister Bandula Gunawardene has instructed officials to draw up a gazette banning the blending of coconut oil."},
		{"paragraph" : "Blending oil helps businesses: it drives profits up and keeps costs down. South Asia is no stranger to such rackets: in 2019, for instance, the Food Safety and Standards Authority of India (FSSAI) banned no fewer than 14 varieties of coconut oil in Kerala after the detection of various toxic substances. Kerala alone saw bans on 70 varieties in December 2018, 51 in June, and 45 in May. Subsequent to these incidents, the FSSAI enacted a new method that could detect adulteration more quickly."},
		{"paragraph" : "Make no mistake, the issues at stake here are serious. The World Health Organisation has in a paper published in 2018 outlined succinctly the dangers of Aflatoxin. One of the most potent carcinogens out there, it has been known to cause birth defects in children, weaken immunity, and raise the risk of liver cancer, not to mention acute poisoning. This belies another danger: the widespread use of carcinogens in food, and not just Aflatoxin. Given World Health Day falls today, it would do well to reflect on the importance of strengthening regulatory institutions tasked with finding and seizing adulterated food."},
		{"paragraph" : "India has a robust regulatory framework that deals with food imports and additives, but this is not to say Sri Lanka lacks one; the Food Control Administrative Unit of the Ministry of Health lists down no fewer than 34 regulations in operation now. As always, the problem is one of execution and implementation. In that sense it is only fair to find fault with a regime that’s given the impression of taking things a little too casually."},
		{"paragraph" : "However, and I reiterate, this is far from the whole story. Any assessment of what’s going on and what people can do to resolve it must centre on three points: the dominance of import rent-seeking interests in the market, the step-motherly treatment given to local manufacturers, and the ease at which import interests co-opt successive governments."},
		{"paragraph" : "The latter phenomenon has been ongoing since 1977. It was under the then UNP government that food imports swamped the market through the ubiquitous import merchants. But to limit any discussion of the effects of such imports to petty traders would be counterproductive: a more comprehensive analysis should take into account precedents set by such administrations in allowing larger corporations, especially powerful multinationals, to bypass laws and play the proverbial fiddle with the health and welfare of the people."},
		{"paragraph" : "Yet if you hear what Opposition MPs have to say on the subject, you’d think that adulterated food imports began swamping the country under this government. Far from it. On the other hand, however, it is true that this government has been not a little slow in its response to the bad press over such issues: an allegation that, to be fair, can as validly be thrown at previous administrations. What’s inexcusable about this administration not taking action is that it came to power on a platform of “going local” and waded through COVID-19 with the pledge of empowering local industry. But far from empowering local industry, let alone establishing it, officials instead have been lackadaisical about taking swift, necessary measures."},
		{"paragraph" : "One example will suffice here. In October 2020 the All Ceylon Traditional Coconut Oil Producers’ Association (ACTCOPA) accused the Consumer Affairs Authority (CAA) of having issued a gazette notification allowing imports of blended oils. The gazette in question was alleged to have been made in October 2016 — under the yahapalana government — by the then Minister of Industries and Commerce, Rishad Bathiudeen."},
		{"paragraph" : "Even though news outlets reported on this matter, hardly anyone followed it through, or seemed interested in doing so. Not even the ACTCOPA’s insinuation that “large-scale racketeers” accrue around Rs. 20 billion every year from the said gazette notification ruffled feathers; nor, for that matter, did its request to the government that “necessary raw materials and machinery” be provided to them immediately."},
		{"paragraph" : "What’s relevant there is that the current scandal over adulterated oil can be traced back to consignments which began arriving here last September, i.e. a month before the ACTCOPA made their accusations. Yet in debates over blended, adulterated oil today, these accusations have hardly gained traction. Neither the Opposition, nor anyone rapping the government over the scandal, seems to be accounting for the two key issues the ACTCOPA raised back then: the billions of rupees we lose out to imports every year, and the plight of local manufacturers who continue to get marginalised even as we consume poison from abroad."},
		{"paragraph" : "Here we come to the inadequacies of the Opposition. Much of the rhetoric over these two scandals has targeted the regime’s alleged protection of the import mafia. Opposition Leader Sajith Premadasa, who calls the oil mafia the “coconut oil demon”, has asked that permits of carcinogenic importers be terminated immediately, while similar sentiments have been expressed by the Opposition (the SJB) regarding the sugar tax fraud."},
		{"paragraph" : "Evidently it has not dawned on Mr Premadasa that such mafias and frauds have been covered up and exonerated by successive administrations in the past as well. Again, one example will suffice. It was NewsFirst which broke the story in full: on February 17, 2018, the Finance Ministry went about introducing a new levy on sugar prices, substituting a Rs 43 tax for a previous levy of Rs 31."},
		{"paragraph" : "While the recent sugar tax fraud has been assessed at Rs 16 billion, this change in the levy also led to a windfall gain for private interests."},
		{"paragraph" : "“It was revealed at the cost of living committee that nearly 60,000 metric tons of sugar are in the possession of these three companies. The increase in taxes has paved the way for these companies to earn a minimum profit Rs. 600 million with a profit margin of Rs.10 per kilogram of sugar.”"},
		{"paragraph" : "Even more interesting here are the names of these three companies: Pyramid Wilmar Pvt Ltd, Wilson Trading Co, and Pallegoda Trading. Of the three, Pyramid Wilmar was accused of purchasing “a majority of stocks following the levy change.”"},
		{"paragraph" : "Now for the icing on the cake: the present Chairman of Sathosa, caught at the centre of the tax fraud today, has connections with the directors of Pyramid Wilmar. In other words, we’re seeing the same game being played, this time with much bigger stakes."},
		{"paragraph" : "Azath Salley may not be the most authoritative voice out there, yet he was succinct in his criticism of the levy change and the enrichment of private corporate interests: “such contracts were only believed to be in operation during the Rajapaksa regime, but… the situation had become widespread under the present government as well.” Add two and two: government then, opposition now; opposition then, government now. The only chairs in the room that remain where they are belong to neither, but to those rent-seekers. Guess who served their interests then, and who are berating the government for serving them now."},
		{"paragraph" : "None of this is to say that we should only concern ourselves with who held power then and who’s opposing those holding it now. These scandals, the oil more than the sugar tax, are serious, and should be taken seriously. Finding carcinogens in food that everyone, regardless of income level and social class, consumes, is worrying. Yet one must acknowledge that such substances are not found only in coconut oil, nor that they are a recent phenomenon, nor that the government has an explicit interest in distributing if not promoting them."},
		{"paragraph" : "Indeed, far from the government being complicit, it is the private sector, the unholy trinity of media, pop culture, and multinational corporation, that has been at the forefront of advertising these substances for consumption. We know this well by now: sports icons and actors earning top dollar promoting toxic foods, and media outlets dependent on advertising such products being reticent in calling out on companies selling them."},
		{"paragraph" : "From Fonterra’s “Milkgate” (which only one editor of repute, Malinda Seneviratne, saw fit to report on then) to Kumar Sangakkara’s controversial associations with cancer-causing foods and beverages (which Grusha Andrews has written on in this extensive piece), it’s really a no-brainer to say the government, whatever the party, ought to be the last on the list of those responsible for toxic chemicals in what we eat and drink."},
		{"paragraph" : "Yet we’re facing something of a quandary here: by refusing to call out on those responsible, and the corporate-merchant interests backing them, we have ended up blackguarding one set of politicians for entering into alliances with the latter, only to have another set succeed them and do the same thing. It’s a morbid game of musical chairs, a danse macabre with the “carcinogenic yakas” (to paraphrase Sajith Premadasa) playing with our lives. When will the government and Opposition learn? More importantly, when will we? We are railing against the system, yes, but that system is one we are a part of: the media, the advertisers, and those icons we look up to, who are promoting the same poisons we accuse the government of bringing in. The latter is complicit, yes. But then so are we."}
	]
}
