{
    "author": "Uditha Devapriya",
    "link": "https://medium.com/perceive-more/some-reflections-on-the-temples-of-the-south-5094e1ab17c5",
    "text": [
        {"paragraph": "The social and cultural history of Buddhist temples in Sri Lanka has been the object of study for well over a century. Far from receding into a world of their own, these temples occupied a prominent place in the world around them. Buddhist monks lived under a code of piety and self-denial, and they operated under their rules and customs..."},
        {"paragraph": "The first proper sociological overview of the relationship between the Buddhist clergy and Sinhala society was R. A. L. H. Gunawardana’s Robe and Plough: Monasticism and Economic Interest in Early Medieval Sri Lanka..."},
        {"paragraph": "Comprehensive as it was, Gunawardana’s book did not delve much into Sri Lanka’s post-Medieval history. Nor did it examine the sociological relevance of Buddhist temple art and architecture..."},
        {"paragraph": "In The Rock and Wall Paintings of Sri Lanka, Bandaranayake divides the history of Buddhist art into four distinct periods: the primitive rock-shelter paintings, associated with prehistoric times and Veddah tribes; the paintings of the Early and Middle Historic Periods, dating from the 5th to the 13th century AD; the Kandyan Period; and the Southern or Maritime Period..."},
        {"paragraph": "I wish here to examine some of his insights on the Southern Tradition. Concentrated along the coastal belt between the Galle and Matara districts, the Southern Tradition has been the object of much study over the decades..."},
        {"paragraph": "Part of the reason why we don’t have a clear answer to this, Bandaranayake observes, is that there is a substantial body of work belonging to the Southern mural tradition that has been lost to us..."},
        {"paragraph": "Perhaps the most important point to note about Buddhist temple art in the South is its immense diversity..."},
        {"paragraph": "These are, to be sure, anecdotal accounts and explanations, and they must be taken with a pinch of salt by the scholar. Yet they cohere with the artistic and architectural motifs of these establishments. Bandaranayake does not fully delve into these aspects of Southern monastic art, but he does imply that there’s a great deal about the tradition that we are yet to ascertain..."}
    ]
}
